{
  "Unknown": {
    "ch113c": [
      {
        "Code": "8.1",
        "Strand": "Economics with Emphasis on the Free Enterprise System and Its Benefits is the culmination of the",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Students identify the role of the U.S. free enterprise system within the parameters of this course",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Economics with Emphasis on the Free Enterprise System and Its Benefits builds upon the",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "As referenced in House Bill 492, an act of the Texas Legislature signed into law in 2005, the",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Economics. The student understands the concepts of scarcity and opportunity costs. The student is",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Economics. The student understands the interaction of supply, demand, and price. The student is",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Economics. The student understands the reasons for international trade and its importance to the",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Economics. The student understands free enterprise, socialist, and communist economic systems.",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Economics. The student understands the basic characteristics and benefits of the U.S. free",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Economics. The student understands the right to own, use, and dispose of private property. The",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Economics. The student understands the circular-flow model of the economy. The student is",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Economics. The student understands types of market structures. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Economics. The student understands key economic measurements. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Economics. The student understands key components of economic growth. The student is",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Economics. The student understands the role of money in an economy. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Economics. The student understands the role of the Federal Reserve System in establishing",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "Economics. The student understands the role that the government plays in the U.S. free enterprise",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Economics. The student understands the economic impact of fiscal policy decisions at the local,",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Personal financial literacy. The student understands types of business ownership. The student is",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Personal financial literacy. The student understands the role of financial markets/institutions in",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Personal financial literacy. The student understands the role of individuals in financial markets.",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Personal financial literacy. The student applies critical-thinking skills to analyze the costs and",
        "Expectations": []
      },
      {
        "Code": "8.19",
        "Strand": "Personal financial literacy. The student understands how to provide for basic needs while living",
        "Expectations": []
      },
      {
        "Code": "8.20",
        "Strand": "Personal financial literacy. The student understands the various methods available to pay for",
        "Expectations": []
      },
      {
        "Code": "8.21",
        "Strand": "Social studies skills. The student applies critical-thinking skills to organize and use information",
        "Expectations": []
      },
      {
        "Code": "8.22",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.23",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In United States History Studies Since 1877, which is the second part of a two-year study that",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The eight strands of the essential knowledge and skills for social studies are intended to be",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students identify the role of the U.S. free enterprise system within the parameters of this course",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history;",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "History. The student understands the principles included in the Celebrate Freedom Week program.",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "History. The student understands traditional historical points of reference in U.S. history from",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "History. The student understands the political, economic, and social changes in the United States",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "History. The student understands the emergence of the United States as a world power between",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "History. The student understands the effects of reform and third-party movements in the early 20th",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "History. The student understands significant events, social issues, and individuals of the 1920s.",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "History. The student understands the domestic and international impact of U.S. participation in",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "History. The student understands the impact of significant national and international decisions and",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "History. The student understands the impact of the American civil rights movement. The student is",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "History. The student understands the impact of political, economic, and social factors in the U.S.",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "History. The student understands the emerging political, economic, and social issues of the United",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Geography. The student understands the impact of geographic factors on major events. The",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "Geography. The student understands the causes and effects of migration and immigration on",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Geography. The student understands the relationship between population growth and the physical",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Economics. The student understands domestic and foreign issues related to U.S. economic growth",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Economics. The student understands significant economic developments between World War I",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Economics. The student understands the economic effects of government policies from World",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Government. The student understands changes over time in the role of government. The student is",
        "Expectations": []
      },
      {
        "Code": "8.19",
        "Strand": "Government. The student understands the changing relationships among the three branches of the",
        "Expectations": []
      },
      {
        "Code": "8.20",
        "Strand": "Government. The student understands the impact of constitutional issues on American society.",
        "Expectations": []
      },
      {
        "Code": "8.21",
        "Strand": "Citizenship. The student understands the concept of American exceptionalism as identified by",
        "Expectations": []
      },
      {
        "Code": "8.22",
        "Strand": "Citizenship. The student understands the promises of the Declaration of Independence and the",
        "Expectations": []
      },
      {
        "Code": "8.23",
        "Strand": "Citizenship. The student understands the importance of effective leadership in a constitutional",
        "Expectations": []
      },
      {
        "Code": "8.24",
        "Strand": "Culture. The student understands the relationship between the arts and the times during which they",
        "Expectations": []
      },
      {
        "Code": "8.25",
        "Strand": "Culture. The student understands how people from various groups contribute to our national",
        "Expectations": []
      },
      {
        "Code": "8.26",
        "Strand": "Science, technology, and society. The student understands the impact of science, technology, and",
        "Expectations": []
      },
      {
        "Code": "8.27",
        "Strand": "Science, technology, and society. The student understands the influence of scientific discoveries,",
        "Expectations": []
      },
      {
        "Code": "8.28",
        "Strand": "Social studies skills. The student understands how historians use historiography to interpret the",
        "Expectations": []
      },
      {
        "Code": "8.29",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.30",
        "Strand": "Social studies skills. The student uses geographic tools to collect, analyze, and interpret data. The",
        "Expectations": []
      },
      {
        "Code": "8.31",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "World History Studies is a survey of the history of humankind. Due to the expanse of world",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "The following periodization should serve as the framework for the organization of this course:",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "The eight strands of the essential knowledge and skills for social studies are intended to be",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "A greater depth of understanding of complex content material can be attained by integrating social",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students identify the role of the U.S. free enterprise system within the parameters of this course",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history;",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "History. The student understands traditional historical points of reference in world history. The",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "History. The student understands how early civilizations developed from 8000 BC to 500 BC. The",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "History. The student understands the contributions and influence of classical civilizations from",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "History. The student understands how, after the collapse of classical empires, new political,",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "History. The student understands the causes, characteristics, and impact of the European",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "History. The student understands the characteristics and impact of the Maya, Inca, and Aztec",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "History. The student understands the causes and impact of increased global interaction from 1450",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "History. The student understands the causes and the global impact of the Industrial Revolution and",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "History. The student understands the causes and effects of major political revolutions between",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "History. The student understands the causes and impact of World War I. The student is expected",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "History. The student understands the causes and impact of the global economic depression",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "History. The student understands the causes and impact of World War II. The student is expected",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "History. The student understands the impact of major events associated with the Cold War and",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "History. The student understands the development and use of radical Islamic terrorism in the",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Geography. The student understands the impact of geographic factors on major historic events and",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Economics. The student understands the impact of the Neolithic and Industrial revolutions and",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Economics. The student understands the historical origins of contemporary economic systems and",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Government. The student understands the characteristics of major political systems throughout",
        "Expectations": []
      },
      {
        "Code": "8.19",
        "Strand": "Government. The student understands how contemporary political systems have developed from",
        "Expectations": []
      },
      {
        "Code": "8.20",
        "Strand": "Citizenship. The student understands the significance of political choices and decisions made by",
        "Expectations": []
      },
      {
        "Code": "8.21",
        "Strand": "Citizenship. The student understands the historical development of significant legal and political",
        "Expectations": []
      },
      {
        "Code": "8.22",
        "Strand": "Culture. The student understands the history and relevance of major religious and philosophical",
        "Expectations": []
      },
      {
        "Code": "8.23",
        "Strand": "Culture. The student understands the roles of women, children, and families in different historical",
        "Expectations": []
      },
      {
        "Code": "8.24",
        "Strand": "Culture. The student understands how the development of ideas has influenced institutions and",
        "Expectations": []
      },
      {
        "Code": "8.25",
        "Strand": "Culture. The student understands the relationship between the arts and the times during which they",
        "Expectations": []
      },
      {
        "Code": "8.26",
        "Strand": "Science, technology, and society. The student understands how major scientific and mathematical",
        "Expectations": []
      },
      {
        "Code": "8.27",
        "Strand": "Science, technology, and society. The student understands how major scientific and mathematical",
        "Expectations": []
      },
      {
        "Code": "8.28",
        "Strand": "Social studies skills. The student understands how historians use historiography to interpret the",
        "Expectations": []
      },
      {
        "Code": "8.29",
        "Strand": "Social studies skills. The student uses geographic skills and tools to collect, analyze, and interpret",
        "Expectations": []
      },
      {
        "Code": "8.30",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.31",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In World Geography Studies, students examine people, places, and environments at local,",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The eight strands of the essential knowledge and skills for social studies are intended to be",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students identify the role of the U.S. free enterprise system within the parameters of this course",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history;",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "History. The student understands how geography and processes of spatial exchange (diffusion)",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "History. The student understands how people, places, and environments have changed over time",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Geography. The student understands how physical processes shape patterns in the physical",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Geography. The student understands the patterns and characteristics of major landforms, climates,",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Geography. The student understands how political, economic, and social processes shape cultural",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Geography. The student understands the types, patterns, and processes of settlement. The student",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Geography. The student understands the growth, distribution, movement, and characteristics of",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Geography. The student understands how people, places, and environments are connected and",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Geography. The student understands the concept of region as an area of Earth's surface with",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Economics. The student understands the distribution, characteristics, and interactions of the",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Economics. The student understands how geography influences economic activities. The student is",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Economics. The student understands the economic importance of, and issues related to, the",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "Government. The student understands the spatial characteristics of a variety of global political",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Government. The student understands the processes that influence political divisions,",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Citizenship. The student understands how different points of view influence the development of",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Culture. The student understands how the components of culture affect the way people live and",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Culture. The student understands the distribution, patterns, and characteristics of different cultures.",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Culture. The student understands the ways in which cultures change and maintain continuity. The",
        "Expectations": []
      },
      {
        "Code": "8.19",
        "Strand": "Science, technology, and society. The student understands the impact of technology and human",
        "Expectations": []
      },
      {
        "Code": "8.20",
        "Strand": "Science, technology, and society. The student understands how current technology affects human",
        "Expectations": []
      },
      {
        "Code": "8.21",
        "Strand": "Social studies skills. The student applies critical-thinking skills to organize and use information",
        "Expectations": []
      },
      {
        "Code": "8.22",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.23",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In United States Government, the focus is on the principles and beliefs upon which the United",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The eight strands of the essential knowledge and skills for social studies are intended to be",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students identify the role of the U.S. free enterprise system within the parameters of this course",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history;",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "History. The student understands how constitutional government, as developed in America and",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "History. The student understands the roles played by individuals, political parties, interest groups,",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Geography. The student understands how geography can influence U.S. political districts and",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Economics. The student understands the roles played by local, state, and national governments in",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Economics. The student understands the relationship between U.S. government policies and the",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Government. The student understands the American beliefs and principles reflected in the U.S.",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Government. The student understands the structure and functions of the government created by the",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Government. The student understands the concept of federalism. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Government. The student understands the processes for filling public offices in the U.S. system of",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Government. The student understands the role of political parties in the U.S. system of",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Government. The student understands the similarities and differences that exist among the U.S.",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Citizenship. The student understands the rights that are protected and secured by the U.S.",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "Citizenship. The student understands the difference between personal and civic responsibilities.",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Citizenship. The student understands the importance of voluntary individual participation in the",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Citizenship. The student understands the importance of the expression of different points of view",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Culture. The student understands the relationship between government policies and the culture of",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Science, technology, and society. The student understands the role the government plays in",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Science, technology, and society. The student understands the impact of advances in science and",
        "Expectations": []
      },
      {
        "Code": "8.19",
        "Strand": "Social studies skills. The student applies critical-thinking skills to organize and use information",
        "Expectations": []
      },
      {
        "Code": "8.20",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.21",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In Psychology, an elective course, students study the science of behavior and mental processes.",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "History. The student understands the development of the field of psychology. The student is",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Science of psychology. The student differentiates the processes of theory development and",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Science of psychology. The student understands the relationship between biology and behavior.",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Science of psychology. The student understands how sensations and perceptions influence",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Individual development. The student understands that development is a life-long process. The",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Individual development. The student understands behavioral and social learning theories. The",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Individual identity. The student understands the principles of motivation and emotion. The student",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Individual identity. The student understands the nature of intelligence. The student is expected to",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Individual identity. The student understands the basic principles of tests and measurements. The",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Individual identity. The student understands the development and assessment of personality. The",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Individual experience. The student understands basic elements of cognition. The student is",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Individual experience. The student understands the multifaceted aspects of mental health. The",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "The individual in society. The student will understand the influence of society and culture on",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Social studies skills. The student applies critical-thinking skills to organize and use information",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Social studies skills. The student develops long-term and short-term goal-setting skills for",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Science and technology. The student understands the relationship of changes in technology to",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Sociology, an elective course, is an introductory study in social behavior and organization of",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Students identify the role of the free enterprise system within the parameters of this course and",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Foundations of sociology. The student understands the theoretical perspectives of the historical",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Foundations of sociology. The student understands how society evolves and cause and effect of",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Culture and social structure. The student examines world cultures. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Culture and social structure. The student understands types of groups and their functions. The",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Culture and social structure. The student differentiates and recognizes examples of subculture and",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Individual and society. The student understands the process of socialization. The student is",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Individual and society. The student understands the concept of adolescence and its characteristics.",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Individual and society. The student understands the life stage of adulthood and its characteristics.",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Individual and society. The student will explain the nature and social function of deviance. The",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Social inequality. The student understands the nature of social stratification in society. The student",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Social inequality. The student understands the impact of race and ethnicity on society. The student",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Social inequality. The student understands changing societal views on gender, age, and health. The",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "Social institutions. The student identifies the basic social institution of the family and explains its",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Social institutions. The student identifies the basic social institutions of economics and politics",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Social institutions. The student identifies the basic social institutions of education and religion and",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Social institutions. The student understands the basic social institutions of science and the mass",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Changing world. The student understands how population and urbanization contribute to a",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Changing world. The student understands how collective behavior, social movements, and",
        "Expectations": []
      },
      {
        "Code": "8.19",
        "Strand": "Social studies skills. The student applies critical-thinking skills to organize and use information",
        "Expectations": []
      },
      {
        "Code": "8.20",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.21",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In Special Topics in Social Studies, an elective course, students are provided the opportunity to",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Social studies skills. The student applies critical-thinking skills to organize and use information",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Social studies skills. The student creates written, oral, and visual presentations of social studies",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In Social Studies Research Methods, an elective course, students conduct advanced research on a",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Social studies skills. The student understands the need for an organizing framework to identify an",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Social studies skills. The student applies a process approach to a research topic, applying the",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Social studies skills. If doing qualitative research, the student employs the processes of critical",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Social studies skills. If doing quantitative research, the student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Social studies skills. The student creates a written and oral presentation of research and",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Social studies skills. The student understands the principles and requirements of the scientific",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Personal Financial Literacy will develop citizens who have the knowledge and skills to make",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Personal Financial Literacy is designed to be an interactive and research-based course. The course",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "This one-half elective credit course includes instruction in methods of paying for college and other",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Earning and spending. The student understands how to set personal financial goals. The student is",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Earning and spending. The student understands how financial statements are used to assess and",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Earning and spending. The student analyzes components of compensation from employment. The",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Earning and spending. The student critically evaluates consumption decisions. The student is",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Saving and investing. The student understands the importance of saving and investing in creating",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Saving and investing. The student understands the implementation of a saving and investing plan.",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Saving and investing. The student demonstrates an understanding of the importance of planning",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Credit and borrowing. The student understands the use of credit to make purchases. The student is",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Credit and borrowing. The student identifies factors that affect credit worthiness. The student is",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Credit and borrowing. The student evaluates a decision to use credit. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Insuring and protecting. The student recognizes financial risks faced by individuals and families",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Insuring and protecting. The student identifies the costs and benefits of insurance for transferring",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "Insuring and protecting. The student understands how to identify and protect themselves from",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Insuring and protecting. The student understands the legal instruments available for estate",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "College and postsecondary education and training. The student recognizes the costs and benefits of",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "College and postsecondary education and training. The student understands various options for",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In Ethnic Studies: Mexican American Studies, an elective course, students learn about the history",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The eight strands of the essential knowledge and skills for social studies are intended to be",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students identify the role of the U.S. free enterprise system within the parameters of this course",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history;",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "History. The student understands historical points of reference in Mexican American history. The",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "History. The student understands developments related to pre-colonial settlements and Spanish",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "History. The student understands developments related to Mexican independence and Mexico's",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "History. The student understands the causes and impact of the Mexican American civil rights",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "History. The student understands the development of voting rights and ideas related to citizenship",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Geography. The student understands the impact of geographic factors on major events related to",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Economics. The student understands domestic issues related to Mexican American population",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Government. The student understands the significance of political decisions and the struggle for",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Citizenship. The student understands the debates surrounding the nature of respectful expression",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Culture. The student understands the relationship between Mexican American artistic expression",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Science, technology, and society. The student understands the impact of Mexican American",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Social studies skills. The student applies critical-thinking skills to organize and use information",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "In Ethnic Studies: African American Studies, an elective course, students learn about the history",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The eight strands of the essential knowledge and skills for social studies are intended to be",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Students identify the role of the U.S. free enterprise system within the parameters of this course",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history;",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "History. The student understands the influential historical points of reference in African history",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "History. The student understands the economic, political, and social development of slavery",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "History. The student understands the rationalization and ramifications for the continuation and",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "History. The student understands African American life from the Civil War through World War I.",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "History. The student understands change and continuity in the African American cultural identity",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "History. The student understands the progress made and challenges faced by African Americans",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Geography. The student understands the impact of geographic factors on major events related to",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Economics. The student understands ways in which African Americans have addressed",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Government. The student understands the significant impact of political decisions on African",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Government. The student understands the impact of political interactions on the African American",
        "Expectations": []
      },
      {
        "Code": "8.11",
        "Strand": "Citizenship. The student understands the importance of multiple and changing points of view",
        "Expectations": []
      },
      {
        "Code": "8.12",
        "Strand": "Culture. The student understands the development of African American culture and society and",
        "Expectations": []
      },
      {
        "Code": "8.13",
        "Strand": "Culture. The student understands the cultural traditions and contributions of African Americans",
        "Expectations": []
      },
      {
        "Code": "8.14",
        "Strand": "Culture. The student understands the influence of artistic expression on the African American",
        "Expectations": []
      },
      {
        "Code": "8.15",
        "Strand": "Culture. The student understands African American educational developments, achievements, and",
        "Expectations": []
      },
      {
        "Code": "8.1954",
        "Strand": ". The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.16",
        "Strand": "Science, technology, and society. The student understands how African American achievements in",
        "Expectations": []
      },
      {
        "Code": "8.17",
        "Strand": "Social studies skills. The student understands how historians use historiography to interpret the",
        "Expectations": []
      },
      {
        "Code": "8.18",
        "Strand": "Social studies skills. The student communicates in written, oral, and visual forms. The student is",
        "Expectations": []
      },
      {
        "Code": "8.19",
        "Strand": "Social studies skills. The student uses geographic tools to collect, analyze, and interpret data. The",
        "Expectations": []
      },
      {
        "Code": "8.20",
        "Strand": "Social studies skills. The student uses problem-solving and decision-making skills, working",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "The student will investigate, independently or collaboratively, a problem, issue, or concern within",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "The student will demonstrate understanding of the research methods and/or technologies used in a",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The student will develop products that meet standards recognized by the selected profession or",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "The student will demonstrate an understanding of the selected problem, issue, or concern by",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "The student will investigate, independently or collaboratively, a problem, issue, or concern within",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "The student will demonstrate understanding of the research methods and/or technologies used in a",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The student will develop products that meet standards recognized by the selected profession or",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "The student will demonstrate an understanding of the selected problem, issue, or concern by",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "The Personal Financial Literacy and Economics Course emphasizes the economic way of thinking,",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Personal Financial Literacy and Economics builds on and extends the economic content and",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "This course was created in response to Texas Education Code (TEC), §28.025(b-22), satisfies the",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "State and federal laws mandate a variety of celebrations and observances, including Celebrate",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Students understand that a constitutional republic is a representative form of government whose",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Statements that contain the word \"including \" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "Economics. The student understands the fundamental concepts of economics. The student is",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Economics. The student understands that macroeconomic issues and policies have an impact on",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "Personal financial literacy--investing in education and skills. The student recognizes the costs and",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "Personal financial literacy--earning. The student recognizes that a variety of factors influence",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Personal financial literacy--entrepreneurship. The student discusses the opportunities available for",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Personal financial literacy--spending. The student understands how to set personal spending goals.",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "Personal financial literacy--credit and debt. The student understands the costs and benefits of",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "Personal financial literacy--saving and investing. The student understands the importance of",
        "Expectations": []
      },
      {
        "Code": "8.9",
        "Strand": "Personal financial literacy--protecting and insuring. The student recognizes financial risks faced",
        "Expectations": []
      },
      {
        "Code": "8.10",
        "Strand": "Personal financial literacy skills. The student understands how to set personal financial goals. The",
        "Expectations": []
      }
    ]
  }
}