{
  "Unknown": {
    "ch127a": [
      {
        "Code": "8.1",
        "Strand": "Career and technical education (CTE) instruction provides content aligned with challenging",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "Career development is a lifelong pursuit of answers to the questions: Who am I? Why am I here?",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The career development process is unique to every person and evolves throughout one's life. In",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "The goal of this course is to help students build career awareness and engage in deep exploration",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "Students are encouraged to explore and participate in extended learning experiences such as career",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "Statements that contain the word \"including\" reference content that must be mastered, while those",
        "Expectations": []
      },
      {
        "Code": "8.1",
        "Strand": "The student takes one or more career interest surveys, aptitude tests, or career assessments and",
        "Expectations": []
      },
      {
        "Code": "8.2",
        "Strand": "The student investigates educational and training requirements for career and education pathways",
        "Expectations": []
      },
      {
        "Code": "8.3",
        "Strand": "The student analyzes educational and career opportunities. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.4",
        "Strand": "The student develops skills for personal success. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.5",
        "Strand": "The student investigates labor market information and recognizes the impact of college and career",
        "Expectations": []
      },
      {
        "Code": "8.6",
        "Strand": "The student investigates job-seeking skills. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.7",
        "Strand": "The student creates professional documents required for employment. The student is expected to:",
        "Expectations": []
      },
      {
        "Code": "8.8",
        "Strand": "The student creates an individual career and academic plan. The student is expected to:",
        "Expectations": []
      }
    ]
  }
}